#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//Начало Володин А.А. 08 ноября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	ФотоДоставкиСсылка = "";
	
	ЗначениеКлюча = Новый Структура;
	ЗначениеКлюча.Вставить("Доставка", Объект.Ссылка);
	
	ЗаписьВРегистр = РегистрыСведений.ФотоДоставок.СоздатьКлючЗаписи(ЗначениеКлюча);
	
	ФотоДоставкиСсылка = ПолучитьНавигационнуюСсылку(ЗаписьВРегистр, "Фотография", 0);
//Конец Володин А.А. 08 ноября 2024 г.
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
//Начало Володин А.А. 08 ноября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	МенеджерЗаписи = РегистрыСведений.ФотоДоставок.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Доставка = Объект.Ссылка;
	
	Если ЭтоАдресВременногоХранилища(ФотоДоставкиСсылка) Тогда
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФотоДоставкиСсылка);
		
		МенеджерЗаписи.Фотография = Новый ХранилищеЗначения(ДвоичныеДанные); 
		МенеджерЗаписи.Записать();
		
	ИначеЕсли ФотоДоставкиСсылка = "" Тогда
		
		МенеджерЗаписи.Фотография = Новый ХранилищеЗначения(Неопределено);
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
//Конец Володин А.А. 08 ноября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФотоДоставкиНажатие(Элемент, СтандартнаяОбработка)
//Начало Володин А.А. 28 октября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	СтандартнаяОбработка = Ложь;
	
	#Если МобильныйКлиент Тогда
		
		Если Не СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда
			
			Сообщить("Камера не доступна");
			Возврат;
			
		КонецЕсли;
		
		ДанныеФото = СредстваМультимедиа.СделатьФотоснимок(ТипКамерыУстройства.Задняя, , , , ТипПодсветкиКамеры.Авто);
		
		Если ДанныеФото = Неопределено Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ФотоДоставкиСсылка = ПоместитьВоВременноеХранилище(ДанныеФото.ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
		
	#КонецЕсли
//Конец Володин А.А. 28 октября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Позвонить(Команда)
//Начало Володин А.А. 28 октября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	СтандартнаяОбработка = Ложь;
	
	#Если МобильныйКлиент Тогда
		
		Если Не СредстваТелефонии.ПоддерживаетсяНаборНомера() Тогда
			
			Сообщить("Набор номера не доступен");
			Возврат;
			
		КонецЕсли;
		
		НомерТелефона = ПолучитьНомерТелефона(Объект.Контрагент);
		
		СредстваТелефонии.НабратьНомер(НомерТелефона, Истина);
			
	#КонецЕсли
//Конец Володин А.А. 28 октября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьНомерТелефона(Контрагент)
//Начало Володин А.А. 28 октября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НомерТелефона = Выборка.НомерТелефона;
		
	КонецЦикла;
	
	Возврат НомерТелефона;
//Конец Володин А.А. 28 октября 2024 г.
КонецФункции

#КонецОбласти









