
&НаКлиенте
Процедура Позвонить(Команда)
//Начало Володин А.А. 28 октября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	СтандартнаяОбработка = Ложь;
	
	#Если МобильноеПриложениеКлиент Тогда
		
		Если Не СредстваТелефонии.ПоддерживаетсяНаборНомера() Тогда
			
			Сообщить("Набор номера не доступен");
			Возврат;
			
		КонецЕсли;
		
		НомерТелефона = ПолучитьНомерТелефона(Объект.Контрагент);
		
		СредстваТелефонии.НабратьНомер(НомерТелефона, Истина);
			
	#КонецЕсли
//Конец Володин А.А. 28 октября 2024 г.
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерТелефона(Контрагент)
//Начало Володин А.А. 28 октября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НомерТелефона = Выборка.НомерТелефона;
		
	КонецЦикла;
	
	Возврат НомерТелефона;
//Конец Володин А.А. 28 октября 2024 г.
КонецФункции

&НаКлиенте
Процедура ФотоДоставкиНажатие(Элемент, СтандартнаяОбработка)
//Начало Володин А.А. 28 октября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	СтандартнаяОбработка = Ложь;
	
	#Если МобильноеПриложениеКлиент Тогда
		
		Если Не СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда
			
			Сообщить("Камера не доступна");
			Возврат;
			
		КонецЕсли;
		
		ДанныеФото = СредстваМультимедиа.СделатьФотоснимок(ТипКамерыУстройства.Задняя, , , , ТипПодсветкиКамеры.Авто);
		
		Если ДанныеФото = Неопределено Тогда
			
			Возврат;
			
		КонецЕсли;
		
		Объект.ФотоДоставки = ПоместитьВоВременноеХранилище(ДанныеФото.ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
		
	#КонецЕсли
//Конец Володин А.А. 28 октября 2024 г.
КонецПроцедуры