#Область ОписаниеПеременных
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	Перем ЗащищенноеСоединение; //Вид соединения. ЗащищенноеСоединениеOpenSSL или Неопределено
	Перем ПараметрыПодключения; //Параметры подключения. Структура
	Перем Соединение; //HTTP-Соединение дляя подключения к центральной базе. HTTPСоединение
	Перем НачалоАдресаСервера; //Часть строки адреса центральной базы начиная после "://"
	Перем АдресБезПротокола; // Часть строки адреса центральной базы без указания протокола соединения
	Перем НачалоРазделителя; // Часть строки центральной базы без указания протокола соединения до "/"
	Перем АдресСервера; //Адрес Сервера центральной базы
	Перем ИмяБазыНаСервере; //Имя центральной базы на сервере
	Перем ЗапросHTTP; //HTTP-запрос для подключения
	Перем Заголовки; //Заголовки HTTP-запроса. Соответствие
	Перем Ping; //HTTP-Сервис Д_ОбменСМобильнымКлиентом Шаблон URL Ping Метод GET
	Перем ОтветСервера; //Ответ сервера со сведениями о статусе подключения
	Перем ОтветСервераСтрока; //Ответ сервера со сведениями о статусе подключения. Строка
// Конец Володин А.А. 23 октября 2024 г.
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АдресЦентральнойБазы.Значение КАК АдресЦентральнойБазы,
		|	Логин.Значение КАК Логин,
		|	Пароль.Значение КАК Пароль
		|ИЗ
		|	Константа.АдресЦентральнойБазы КАК АдресЦентральнойБазы,
		|	Константа.Логин КАК Логин,
		|	Константа.Пароль КАК Пароль";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		АдресЦентральнойБазы = ВыборкаДетальныеЗаписи.АдресЦентральнойБазы;
		Логин = ВыборкаДетальныеЗаписи.Логин;
		Пароль = ВыборкаДетальныеЗаписи.Пароль;
	КонецЦикла;
// Конец Володин А.А. 23 октября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресЦентральнойБазыПриИзменении(Элемент)
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	ЗаписатьАдресЦентральнойБазыВКонстанту(АдресЦентральнойБазы);
// Конец Володин А.А. 23 октября 2024 г.
КонецПроцедуры

&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	ЗаписатьЛогинВКонстанту(Логин);
// Конец Володин А.А. 23 октября 2024 г.
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	ЗаписатьПарольВКонстанту(Пароль);
// Конец Володин А.А. 23 октября 2024 г.
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	ПроверитьСоединениеНаСервере();
// Конец Володин А.А. 23 октября 2024 г.
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокЗаказов(Команда)
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	ОбновитьСписокЗаказовНаСервере();
// Конец Володин А.А. 23 октября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьАдресЦентральнойБазыВКонстанту(АдресБазы)
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	Константы.АдресЦентральнойБазы.Установить(АдресБазы);
// Конец Володин А.А. 23 октября 2024 г.
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЛогинВКонстанту(Логин)
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	Константы.Логин.Установить(Логин);
// Конец Володин А.А. 23 октября 2024 г.
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПарольВКонстанту(Пароль)
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	Константы.Пароль.Установить(Пароль);	
// Конец Володин А.А. 23 октября 2024 г.
КонецПроцедуры

&НаСервере
Функция ЗапросНаСервер(АдресБазы, АдресСервиса)
//Начало Володин А.А. 23 октября 2024 г.
//Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	//Определим параметры подключения:
	ПараметрыПодключения = ПолучитьПараметрыПодключения(АдресБазы);
	
	//Создадим соединение:
	Соединение = УстановитьСоединение(ПараметрыПодключения);
	
	//Создадим и отправим HTTP-Запрос:
	Заголовки = Новый Соответствие();
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ИДКлиента = СистемнаяИнформация.ИдентификаторКлиента;
	
	Заголовки.Вставить("x_MobileID", Строка(ИДКлиента));
	
	ЗапросHTTP = Новый HTTPЗапрос(ПараметрыПодключения.ИмяБазыНаСервере + АдресСервиса, Заголовки);
	
	ОтветСервера = Соединение.Получить(ЗапросHTTP);
	
	Возврат ОтветСервера;
//Конец Володин А.А. 23 октября 2024 г.
КонецФункции

&НаСервере
Функция ПолучитьПараметрыПодключения(АдресБазы)
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	Результат = Новый Структура;
	
	Если Лев(АдресБазы, 5) = "https" Тогда
		
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
		
	Иначе
		
		ЗащищенноеСоединение = Неопределено;
		
	КонецЕсли;
	
	НачалоАдресаСервера = СтрНайти(АдресБазы, "://") + 3;
	АдресБезПротокола = Сред(АдресБазы, НачалоАдресаСервера);
	НачалоРазделителя = СтрНайти(АдресБезПротокола, "/");
	
	АдресСервера = Лев(АдресБезПротокола, НачалоРазделителя - 1);
	ИмяБазыНаСервере = Сред(АдресБезПротокола, НачалоРазделителя);
	
	Результат.Вставить("АдресСервера", АдресСервера);
	Результат.Вставить("ИмяБазыНаСервере", ИмяБазыНаСервере);
	Результат.Вставить("ЗащищенноеСоединение", ЗащищенноеСоединение);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	
	Возврат Результат;
// Конец Володин А.А. 23 октября 2024 г.
КонецФункции

&НаСервере
Функция УстановитьСоединение(ПараметрыПодключения)
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	Соединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера, , ПараметрыПодключения.Логин, ПараметрыПодключения.Пароль, , ПараметрыПодключения.ЗащищенноеСоединение);
	
	Возврат Соединение;
// Конец Володин А.А. 23 октября 2024 г.
КонецФункции

&НаСервере
Процедура ОбновитьСписокЗаказовНаСервере()
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	ОтветСервера = ЗапросНаСервер(АдресЦентральнойБазы, "/hs/mobile/delivery");
	
	ОтветСервераСтрока = ОтветСервера.ПолучитьТелоКакСтроку();
	
	Если ОтветСервера.КодСостояния <> 200 Тогда
		
		Сообщить(СтрШаблон("Error: %1", ОтветСервераСтрока));
		
		Возврат;
		
	Иначе
		
		//МассивДоставок = ПрочитатьЗначениеJSON(ОтветСервераСтрока); //Метод доступен начиная с версии 8.3.23
		//ЧтениеJSON = Новый ЧтениеJSON;
		//ЧтениеJSON.УстановитьСтроку(ОтветСервераСтрока);
		//МассивДоставок = ПрочитатьJSON(ЧтениеJSON);
		//ЧтениеJSON.Закрыть();
		//
		//КоличествоНовыхЗаказов = 0;
		//
		//Для Каждого Доставка Из МассивДоставок Цикл
		//
		//Сообщить(СтрШаблон("Новый заказ от %1 № %2.
		//						|Заказчик: %3.
		//						|Комментарий: %4",
		//						Доставка.Дата, Доставка.Номер, Доставка.Контрагент, Доставка.Комментарий));
		//	
		//	КоличествоНовыхЗаказов = КоличествоНовыхЗаказов + 1;
		//
		//КонецЦикла;
		
		Сообщить(СтрШаблон("У вас заказов: %1", ОтветСервераСтрока));
		
	КонецЕсли
// Конец Володин А.А. 23 октября 2024 г.
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоединениеНаСервере(); 
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройств
	ОтветСервера = ЗапросНаСервер(АдресЦентральнойБазы, "/hs/mobile/ping");
	
	ОтветСервераСтрока = ОтветСервера.ПолучитьТелоКакСтроку(); //При обмене с внешними сервисами необходимо указывать кодировку и раскодировать
	
	Если ОтветСервера.КодСостояния <> 200 Тогда
		
		Сообщить(СтрШаблон("Error: %1", ОтветСервераСтрока));
		
		Возврат;
		
	Иначе
		
		Сообщить(СтрШаблон("Ok: %1", ОтветСервераСтрока));
		
	КонецЕсли
//Конец Володин А.А. 23 октября 2024 г.
КонецПроцедуры

#КонецОбласти
